/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstadd.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ititkov <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/12/19 11:10:11 by ititkov           #+#    #+#             */
/*   Updated: 2019/03/20 19:49:20 by ititkov          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Функция создаёт новый элемент списка
*/

void	ft_lstadd(t_lbft_list **alst, t_lbft_list *new)
{
	if (new != NULL)
	{
		new->next = *alst;
		*alst = new;
	}
}
