/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_memchr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ititkov <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/12/12 15:32:42 by ititkov           #+#    #+#             */
/*   Updated: 2018/12/21 09:57:44 by ititkov          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Функция находит первое вхождение символа с, конвертированного в беззнаковый
** char в строке s. Функция возвращает указатель на байт, в котором обнаружен
** символ. Если символ не обнаружен, возвращает NULL. Начальная позиция для
** поиска задаётся через [ ].
**
** Аргументы s - строка; c - символ; n - длина участка строки на котором
** функция ищет символ.
*/

void	*ft_memchr(const void *s, int c, size_t n)
{
	char	*str;
	size_t	i;

	i = 0;
	str = (char *)s;
	while (i < n)
	{
		if ((unsigned char)str[i] == (unsigned char)c)
			return ((char *)s + i);
		i++;
	}
	return (NULL);
}
