/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_numposneg.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ititkov <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/12/19 15:40:10 by ititkov           #+#    #+#             */
/*   Updated: 2018/12/21 11:17:08 by ititkov          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
#include "stdio.h"

/*
** Функция проверяет является ли аргумент положительным или отрицательным числом
** в первом случае возвращает 1, во втором -1
*/

int		ft_numposneg(int num)
{
	if (num >= 0)
		return (1);
	else
		return (-1);
}
