/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_numevenodd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ititkov <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/12/19 15:07:03 by ititkov           #+#    #+#             */
/*   Updated: 2018/12/20 21:06:07 by ititkov          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Функция возвращает 0 если аргумент - чётное число, 1 если нечётное
*/

int		ft_numevenodd(int num)
{
	if (!(num % 2))
		return (0);
	else
		return (1);
}
