/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ititkov <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/12/14 16:58:05 by ititkov           #+#    #+#             */
/*   Updated: 2019/03/25 20:12:47 by ititkov          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Функция аналог ft_putchar только с возможностью выбора варианта
** вывода с помощью дескриптора fd
*/

void	ft_putchar_fd(char c, int fd)
{
	write(fd, &c, 1);
}
