/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strequ.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ititkov <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/12/14 09:45:28 by ititkov           #+#    #+#             */
/*   Updated: 2018/12/21 10:59:33 by ititkov          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Тернарная операция: Если результат ftstrcmp true, вернуть 0, иначе 1
*/

int		ft_strequ(char const *s1, char const *s2)
{
	if (!s1 || !s2)
		return (-1);
	return (ft_strcmp(s1, s2) ? 0 : 1);
}
